** Code
#+NAME: ex11
#+BEGIN_SRC C
  #include <stdio.h>

  void inplace_swap(int *x, int *y) {
    ,*y = *x ^ *y;                 /* Step 1 */
    ,*x = *x ^ *y;                 /* Step 2 */
    ,*y = *x ^ *y;                 /* Step 3 */
  }

  void reverse_array(int a[], int cnt) {
    int first, last;
    for (first = 0, last = cnt - 1; first < last; first++, last--) {
      inplace_swap(&a[first], &a[last]);
    }
  }

  void show(int a[], int len) {
    for (int i = 0; i < len; ++i) {
      printf("%d ", a[i]);
    }
    printf("\n");
  }

  int main() {
    int a[] = {1, 2, 3, 4};
    int b[] = {1, 2, 3, 4, 5};

    show(a, 4);
    reverse_array(a, 4);
    show(a, 4);

    show(b, 5);
    reverse_array(b, 5);
    show(b, 5);

    return 0;
  }
#+END_SRC

#+RESULTS: swap
| 1 | 2 | 3 | 4 |   |
| 4 | 3 | 2 | 1 |   |
| 1 | 2 | 3 | 4 | 5 |
| 5 | 4 | 3 | 2 | 1 |
** Code
#+NAME: ex12
#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    int x = 0x87654321;
    int a = x & 0x000000FF;
    int b = (~x & 0xFFFFFF00) | (x & 0x000000FF);
    int c = x | 0xFF;

    printf("%#010X\n%#010X\n%#010X\n%#010X\n", x, a, b, c);

    return 0;
  }
#+END_SRC

#+RESULTS: mask
| 0X87654321 |
| 0X00000021 |
| 0X789ABC21 |
| 0X876543FF |
** Code
#+NAME: ex13
#+BEGIN_SRC C
  #include <stdio.h>

  /* Declarations of functions implementing operations bis and bic */
  int bis(int x, int m) {
    return x | m;
  }

  int bic(int x, int m) {
    return x & ~m;
  }

  /* Compute x|y using only calls to functions bis and bic */
  int bool_or(int x, int y) {
    int result = bis(x, y);
    return result;
  }

  /* Compute x^y using only calls to functions bis and bic */
  int bool_xor(int x, int y) {
    int result = bis(bic(x, y), bic(y, x));
    return result;
  }

  int main() {
    printf("%d\n", bis(2, 1));
    printf("%d\n", bic(3, 1));
    printf("%d\n", bool_or(2, 1));
    printf("%d\n", bool_or(5, 1));
    printf("%d\n", bool_or(5, 2));
    printf("%d\n", bool_xor(2, 1));
    printf("%d\n", bool_xor(5, 2));
    printf("%d\n", bool_xor(10, 7));
  }
#+END_SRC

#+RESULTS: devax
|  3 |
|  2 |
|  3 |
|  5 |
|  7 |
|  3 |
|  7 |
| 13 |
* Practice Problem 2.15
#+NAME: ex15
#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    int a = 7;
    int b = 7;
    int c = 4;

    int res1 = !((~a & b) | (a & ~b));
    int res2 = !((~a & c) | (a & ~c));

    printf("Res1: %d / Res2: %d", res1, res2);

    return 0;
  }
#+END_SRC

#+RESULTS: equals
: Res1: 1 / Res2: 0
* Practice Problem 2.21
  | Expression                    | Type     | Evaluation |
  |-------------------------------+----------+------------|
  | -2147483647-1 ==  2147483648U | Signed   |         1* |
  | -2147483647-1  <  2147483647  | Signed   |          1 |
  | -2147483647-1U <  2147483647  | Unsigned |         0* |
  | -2147483647-1  < -2147483647  | Signed   |          1 |
  | -2147483647-1U < -2147483647  | Signed   |          1 |

#+NAME: ex21
#+BEGIN_SRC C
  #include <stdio.h>

  int main() {
    printf("Result: %d\n", -2147483647-1 ==  2147483648U);
    printf("Result: %d\n", -2147483647-1  <  2147483647);
    printf("Result: %d\n", -2147483647-1U <  2147483647);
    printf("Result: %d\n", -2147483647-1  < -2147483647);
    printf("Result: %d\n", -2147483647-1U < -2147483647);

    return 0;
  }
#+END_SRC

#+RESULTS: convert
| Result: | 1 |
| Result: | 1 |
| Result: | 0 |
| Result: | 1 |
| Result: | 1 |
* Practice Problem 2.23
#+NAME: ex23
#+BEGIN_SRC C
  #include <stdio.h>

  int fun1(unsigned word) {
    return (int) ((word <<  24) >>  24);
  }

  int fun2(unsigned word) {
    return ((int) word <<  24) >> 24
  }

  int main() {
    unsigned w1 = 0x00000076;
    unsigned w2 = 0x87654321;
    unsigned w3 = 0x000000C9;
    unsigned w4 = 0xEDCBA987;

    printf("fun1(w) %d fun2(w) %d\n", fun1(w1), fun2(w1));
    printf("fun1(w) %d fun2(w) %d\n", fun1(w2), fun2(w2));
    printf("fun1(w) %d fun2(w) %d\n", fun1(w3), fun2(w3));
    printf("fun1(w) %d fun2(w) %d\n", fun1(w4), fun2(w4));

    return 0;
  }
#+END_SRC

#+RESULTS: cast
| fun1(w) | 118 | fun2(w) |  118 |
| fun1(w) |  33 | fun2(w) |   33 |
| fun1(w) | 201 | fun2(w) |  -55 |
| fun1(w) | 135 | fun2(w) | -121 |
* Practice Problem 2.25
#+NAME: ex25
#+BEGIN_SRC C
  #include <stdio.h>

  /* WARNING: This is buggy code */
  float sum_elements(float a[], unsigned length) {
    int i;
    float result = 0;

    /* for (i = 0; i <= length - 1; i++) { */
    for (i = 0; i < length; i++) {
      result += a[i];
    }
    return result;
  }

  int main() {
    float v[] = {1, 2};

    printf("%f\n", sum_elements(v, 2));
    printf("%f\n", sum_elements(v, 1));
    printf("%f\n", sum_elements(v, 0));

    return 0;
  }
#+END_SRC

#+RESULTS: ex25
| 3.0 |
| 1.0 |
| 0.0 |
* Practice Problem 2.26
#+NAME: ex26
#+BEGIN_SRC C
  #include <stdio.h>
  #include <string.h>

  /* Determine whether string s is longer than string t */
  /* WARNING: This is buggy code */
  int strlonger(char *s, char *t) {
    int diff = strlen(s) - strlen(t);
    return diff > 0;
    /* return strlen(s) - strlen(t) > 0; */
  }

  int main() {
    char *s1 = "ABC";
    char *s2 = "ABCDEF";

    printf("%d\n", strlonger(s1, s2));
    printf("%d\n", strlonger(s2, s1));
    return 0;
  }
#+END_SRC

#+RESULTS: ex26
| 0 |
| 1 |
* Practice Problem 2.27
#+NAME: ex27
#+BEGIN_SRC C
  #include <stdio.h>
  #include <limits.h>

  /* Determine whether arguments can be added without overflow */
  int uadd_ok(unsigned x, unsigned y);

  int uadd_ok(unsigned x, unsigned y) {
    unsigned sum = x + y;
    return (sum < x || sum < y) ? 0 : 1;
  }

  int main() {
    unsigned a = 1;
    unsigned b = UINT_MAX;

    printf("%d (%u)\n", uadd_ok(a, a), a + a);
    printf("%d (%u)\n", uadd_ok(a, b), a + b);
    return 0;
  }
#+END_SRC

#+RESULTS: ex27
| 1 | (2) |
| 0 | (0) |
* Practice Problem 2.30
#+NAME: ex30
#+BEGIN_SRC C
  #include <stdio.h>
  #include <limits.h>

  /* Determine whether arguments can be added without overflow */
  int tadd_ok(int x, int y);

  int tadd_ok(int x, int y) {
    int sum = x + y;
    if (x > 0 && y > 0 && sum < 0) {
      return 0;
    } else if (x < 0 && y < 0 && sum > 0) {
      return 0;
    }
    return 1;
  }

  int main() {
    int a = INT_MIN;
    int b = INT_MAX;
    int c = -1;
    int d = 1;

    printf("%d (%d)\n", tadd_ok(a, c), a + c);
    printf("%d (%d)\n", tadd_ok(b, d), b + d);
    printf("%d (%d)\n", tadd_ok(c, c), c + c);
    printf("%d (%d)\n", tadd_ok(d, d), d + d);

    return 0;
  }
#+END_SRC

#+RESULTS: ex30
| 0 | (2147483647)  |
| 0 | (-2147483648) |
| 1 | (-2)          |
| 1 | (2)           |
** Code
#+NAME: ex32
#+BEGIN_SRC C
  #include <stdio.h>
  #include <limits.h>

  /* Determine whether arguments can be subtracted without overflow */
  int tsub_ok(int x, int y);

  int tsub_ok(int x, int y) {
    int sum = x + y;
    if (x > 0 && y > 0 && sum < 0) {
      return 0;
    } else if (x < 0 && y < 0 && sum > 0) {
      return 0;
    }
    return 1;
  }

  int main() {
    int a = INT_MIN;
    int b = INT_MAX;
    int c = -1;
    int d = 1;

    printf("%d (%d)\n", tsub_ok(a, d), a - d);
    printf("%d (%d)\n", tsub_ok(a, c), a - c);

    printf("%d (%d)\n", tsub_ok(b, c), b - c);
    printf("%d (%d)\n", tsub_ok(b, d), b - d);

    printf("%d (%d)\n", tsub_ok(c, c), c - c);
    printf("%d (%d)\n", tsub_ok(d, d), d - d);
    printf("%d (%d)\n", tsub_ok(c, d), c - d);

    return 0;
  }
#+END_SRC

#+RESULTS: ex32
| 1 | (2147483647)  |
| 0 | (-2147483647) |
| 1 | (-2147483648) |
| 0 | (2147483646)  |
| 1 | (0)           |
| 1 | (0)           |
| 1 | (-2)          |
** Code
#+NAME: ex35
#+BEGIN_SRC C
  #include <stdio.h>
  #include <limits.h>

  /* Determine whether arguments can be multiplied without overflow */
  int tmult_ok(int x, int y) {
    int p = x*y;
    /* Either x is zero, or dividing p by x gives y */
    return !x || p/x == y;
  }

  int main() {
    int a = 0;
    int b = 2;
    int c = 5;
    int d = INT_MAX;

    printf("%d (%d)\n", tmult_ok(a, a), a * a);
    printf("%d (%d)\n", tmult_ok(b, c), b * c);
    printf("%d (%d)\n", tmult_ok(b, d), b * d);

    return 0;
  }
#+END_SRC

#+RESULTS: ex35
| 1 | (0)  |
| 1 | (10) |
| 0 | (-2) |
* Practice Problem 2.36
#+NAME: ex36
#+BEGIN_SRC C
  #include <stdio.h>
  #include <stdlib.h>
  #include <limits.h>

  /* Determine whether arguments can be multiplied without overflow */
  int tmult_ok(int64_t x, int64_t y) {
    int64_t p = x*y;
    return p == (int)(x*y);
  }

  int main() {
    int a = 0;
    int b = 2;
    int c = 5;
    int d = INT_MAX;

    printf("%d (%d)\n", tmult_ok(a, a), a * a);
    printf("%d (%d)\n", tmult_ok(b, c), b * c);
    printf("%d (%d)\n", tmult_ok(b, d), b * d);

    return 0;
  }
#+END_SRC

#+RESULTS: ex36
| 1 | (0)  |
| 1 | (10) |
| 0 | (-2) |
